{
    "bg_image": "/img/photo/3.jpg",
    "title": "Frequently Asked Questions",
    "subtitle": "FAQs",
    "description": "If you do not see an answer to your questions here, please feel free to contact us and we will be happy to get you an answer.",
    "items": [
        {
            "title": "What Conditions are Related to the Contaminated Water at Camp Lejeune?",
            "text": "This is a loaded question.  The federal government and/or its agencies has expressly acknowledged a causal relationship between certain diseases and conditions and the contaminated water at Camp Lejeune.  For example:<br><ol><li>In 2012, a federal law called the Janey Ensminger Act (38 U.S.C. 1710(e)(1) was passed, awarding medical benefits to veterans and their families who were exposed to water at Camp Lejeune between 1957 and 1987 and subsequently diagnosed with 15 specified diseases: esophageal cancer, lung cancer, breast cancer, bladder cancer, kidney cancer, leukemia, multiple myeloma, myelodysplastic syndromes, renal toxicity, hepatic steatosis, female infertility, miscarriage, scleroderma, neurobehavioral effects, and non-Hodgkin’s lymphoma.</li><li>In 2017, the VA expanded the Ensminger Act by presumptively linking 8 diseases to the toxic water:  liver cancer, Parkinson’s disease, bladder cancer, kidney cancer, adult leukemia, multiple myeloma, aplastic anemia (and other myelodysplastic syndromes), and non-Hodgkin’s lymphoma.</li><li>In 2017, the Agency for Toxic Substances and Disease Registry (ATSDR), which is a part of the CDC – after conducting an extensive study – concluded that a causal relationship exists between the contaminated water at Camp Lejeune and the following diseases: kidney cancer; non-Hodgkin’s lymphoma; multiple myeloma; leukemia; liver cancer; bladder cancer; Parkinson’s disease; end-stage renal disease; systematic sclerosis/scleroderma; and cardiac defects.</li></ol><br>Additional governmental and expert studies have been conducted linking other conditions to the contaminated water at Camp Lejeune.  The appointed Plaintiff Leadership Group is continuing to work with experts to analyze additional conditions, injuries, cancers, and diseases which “as likely as not” are caused by exposure to contaminated water at Camp Lejeune.            "
        },
        {
            "title": "Will This Affect My VA Benefits?",
            "text": "No.  This is the most common question we receive from veterans due to the fear of losing access to significant VA disability and medical benefits.  The VA and Government has been clear in responding to these concerns that: Filing a claim under the Camp Lejeune Justice Act (CLJA) will have no impact on your VA disability, widow or medical benefits. Similar to any other injury lawsuit, the law does allow for any amount of VA disability or Medicare/Medicaid benefits related to the illness giving rise to the CLJA claim to be offset from any award or settlement; however, the government could agree to waive that offset when that time comes. <a href='https://wallacegraham.com/filing-a-camp-lejeune-claim-affect-va-benefits' target='_blank'>Click here to read our detailed blog, further explaining how your claim will have NO impact on your VA benefits.</a>"
        },
        {
            "title": "What If A Potential Claimant Died Many Years Ago?",
            "text": "Deceased individuals, regardless of how long ago they passed away, can also qualify for a claim through their estate's personal representative."
        },
        {
            "title": "How Long Do We Have To File A Claim?",
            "text": "According to the Camp Lejeune Justice Act, a claim cannot be commenced after the later of (a) two years after the date of enactment of the Act (August 10, 2024) or (b) 180 days after the date on which your administrative claim is denied under section 2675 of title 28, United States Code. An administrative claim form should be filed by August 10, 2024.  If your claim is not filed within the allotted time, you may be forever barred from seeking recovery."
        },
        {
            "title": "Is This Only For Marines?",
            "text": "No! This new law allows anyone who was exposed to the toxic Camp Lejeune water from 1953 to 1987 (for at least 30 days) to bring a claim. This includes Marines, their family members, civilian employees, and anyone else who was exposed."
        },
        {
            "title": "Where Will The Cases Be Filed?",
            "text": "First, each claim must be filed administratively with the Department of the Navy's JAG office. If that office either denies the claim or fails to act on it within six months, it can then be filed only in federal court in the Eastern District of North Carolina."
        },
        {
            "title": "Is This A Class Action Lawsuit?",
            "text": "No. This is an individual claim for you or your loved-one. A class action involves a group of plaintiffs who have a similar injury. In this case, there are many different situations - some have died, some have become disabled, and some have recovered. Each of our clients' situations are unique and is evaluated on an individual basis."
        },
        {
            "title": "How Long Will This Take?",
            "text": "Trials are expected to begin on Track 1 conditions (Kidney Cancer, Bladder Cancer, Leukemia, Non-Hodgkin’s Lymphoma, and Parkinson’s Disease) in the late fall 2024.  Track 2 cases which will be subsequently litigated include: Kidney Disease (End State Renal Disease and Chronic Kidney Disease), Liver Cancer, Prostate Cancer, Lung Cancer, and Breast Cancer.  Additional tracks will continue to be selected by the Court."
        },
        {
            "title": "Is There a Settlement Option Available?",
            "text": "Yes. The Department of Justice has produced a settlement option known as the <a href='https://camplejeunecourtinfo.com/wp-content/uploads/DE-20-United-States-Notice-of-Elective-Option.pdf' target='_blank'>Elective Option (EO)</a> which provides a framework for settling nine (9) conditions [Kidney Cancer, Liver Cancer, NHL, Leukemias, Bladder Cancer, Multiple Myeloma, Parkinson’s Disease, Kidney Disease, & Systemic Sclerosis/Systemic Scleroderma] with settlement ranges from $100,000 to $550,000; however, this option is only available to claimants whose disease manifested 35 years or less after the claimant was last exposed to contaminated water at Camp Lejeune.  If you have questions regarding whether your case qualifies for settlement, please do not hesitate to contact our firm."
        }
    ]
}